#+STARTUP: indent
##+STARTUP: content
#+STARTUP: overview
##+STARTUP: hidestars
##+TODO: ALT | NEU
#+TODO: TODO(t) RUNNING test(a) | DONE(d)
#+TODO: merge | MERGED
##+TODO: TODO(t) | DONE(d)
##+TODO: REPORT(r) BUG(b) KNOWNCAUSE(k) | FIXED(f)
#+TODO: delayed | CANCELED(c) INVALID DELAYED
#+TAGS: { @OFFICE(o) @HOME(h) } COMPUTER(c) PHONE(p)


* Arbeitszeiten
** Jan
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Feb
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Mar
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Apr
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Mai
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Jun
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Jul
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Aug
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Sep
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Okt
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Nov
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Dez
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)
** Muster
| Anf | Ende |  Korr | Zeit | Abwes | ÜS |      |
|-----+------+-------+------+-------+----+------|
|     |      | 00:30 | -0.5 |       |    | 0.50 |
|-----+------+-------+------+-------+----+------|
|     |      |       | -0.5 |     0 |  0 | 0.00 |
#+TBLFM: @>$4=vsum(@I..@II)::@>$5=vsum(@I..@II)::$5=if(("$1"!="nan")&&(($2-$1>=1)||($2==$1)), $2-$1+1, string(""));E::$4=if($5<1,($2-$1)*24-$7, 8*$5-$7)::$7=$3;t::$6=if($5=0&&$4>0,$4-8,string(""))::@>$6=vsum(@I..@II)

** Urlaub
|     |    anf |    end | tg |
| sum |     36 |     26 | 10 |
| x   | 10.03. | 13.03. |  2 |
| x   | 28.03. | 03.04. |  5 |
|     | 27.05. |        |  1 |
|     | 10.06. |        |  1 |
|     | 17.08. | 23.08. |  5 |
|     | 08.09. | 12.09. |  3 |
|     | 03.10. | 10.10. |  5 |
|     | 27.12. | 31.12. |  4 |
#+TBLFM: @2$3=vsum(@3$4..@10$4)
#+TBLFM: @2$4=@2$2-@2$3

 * <2022-03-10 Do>-<2022-03-13 So> 
 * <2022-03-28 Mo>-<2022-04-03 So>
 * <2022-05-27 Fr> (Brückentag)
 * <2022-06-10 Fr> (Hochzeit)
 * <2022-08-17 Mi>-<2022-08-23 Di> (Joss Stone und Ober Ammergau)
 * <2022-09-08 Do>-<2022-09-12 Mo> (Hochzeit)
 * <2022-10-03 Mo>-<2022-10-10 Mo> (Sylt)
 * <2022-12-27 Di>-<2022-12-31 Sa>

** Krank
 * <2022-03-14 Mo>
 * <2022-03-23 Mi>
 * <2022-03-24 Do>
** misc.
*** erste hilfe
<2022-05-18 Mi>

